In [ ]:
Introduction to DataFrame:

In [ ]:
Def:
    A DataFrame is a Two-Dimensional Data Structure Data is aligned in a Tabular Fashion in rows and coloumns

In [ ]:
General syntax of DataFrame.

In [ ]:
Pandas.DataFrame(data,index,coloumns,dtype,copy)

In [ ]:
Creating DataFrames:-

In [1]:
import numpy as np
import pandas as pd

In [ ]:
Req: creating an empty DataFrame:

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
Req:Creating a DataFrame from lists:

In [3]:
data=['sam','shafi','syed','azeem']

In [4]:
df=pd.DataFrame(data)
print(df)

       0
0    sam
1  shafi
2   syed
3  azeem

In [5]:
data=[['sam',25],['azeem',19],['syed',22],['shafi',30]]

In [6]:
df=pd.DataFrame(data,columns=['name','marks'])

In [7]:
df

    name  marks
0    sam     25
1  azeem     19
2   syed     22
3  shafi     30

In [8]:
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'],columns=['name','marks'])

df

        name  marks
rank1    sam     25
rank2  azeem     19
rank3   syed     22
rank4  shafi     30

In [ ]:
Creating a dataframe from the dict

In [9]:
data={'name':['sam','shafi','syed','azeem'],'marks':[25,32,15,22]}  #Key values will be considered as col names....!

In [10]:
df=pd.DataFrame(data)
df

    name  marks
0    sam     25
1  shafi     32
2   syed     15
3  azeem     22